nowhard/STM32_TABLO/freertos_test/main.c

#include "stm32f4xx.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_tim.h"
#include "stm32f4xx_spi.h"
#include "stm32f4xx_dma.h"
#include <misc.h>
#include "system_stm32f4xx.h"

#include <stdio.h>
#include <math.h>

//FreeRTOS:

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"


#include "tablo_parser.h"
#include "spi_bus.h"
#include "tablo.h"
#include "proto.h"
#include "keyboard.h"
#include "buzzer.h"
#include "power.h"

extern struct tablo tab;//
static void Init_Task(void *pvParameters);//
const uint8_t test_frame_1[]={0x3A,0x7C,0x5B,0x00,0x38,0x38,0x38,0x5D,0x5B,0x01,0x38,0x38,0x38,0x5D,0x5B,0x02,0x38,0x38,0x38,0x5D,0x5B,0x03,0x38,0x38,0x38,0x5D,0x5B,0x04,0x38,0x38,0x38,0x5D,0x5B,0x05,0x38,0x38,0x38,0x5D,0x5B,0x06,0x38,0x38,0x38,0x5D,0x5B,0x07,0x38,0x38,0x38,0x5D,0x5B,0x08,0x38,0x38,0x38,0x38,0x38,0x5D,0x5B,0x0A,0x38,0x38,0x38,0x38,0x38,0x5D,0x5B,0x0B,0x38,0x38,0x38,0x5D,0x5B,0x0C,0x38,0x38,0x38,0x38,0x38,0x5D,0x5B,0x0D,0x00,0x20,0xFF,0xFF,0x5D,0x5B,0x0E,0x00,0x20,0xFF,0xFF,0x5D,0x5B,0x0F,0x00,0x20,0xFF,0xFF,0x5D,0x5B,0x10,0x00,0x20,0xFF,0xFF,0x5D,0x5B,0x12,0x00,0x20,0xFF,0xFF,0x5D,0x5B,0x13,0x00,0x20,0xFF,0xFF,0x5D,0x5B,0x2A,0x0F,0x5D};
const uint8_t test_frame_2[]={0x3A,0x7C,0x5B,0x00,0x38,0x38,0x38,0x5D,0x5B,0x01,0x38,0x38,0x38,0x5D,0x5B,0x02,0x38,0x38,0x38,0x5D,0x5B,0x03,0x38,0x38,0x38,0x5D,0x5B,0x04,0x38,0x38,0x38,0x5D,0x5B,0x05,0x38,0x38,0x38,0x5D,0x5B,0x06,0x38,0x38,0x38,0x5D,0x5B,0x07,0x38,0x38,0x38,0x5D,0x5B,0x08,0x38,0x38,0x38,0x38,0x38,0x5D,0x5B,0x0A,0x38,0x38,0x38,0x38,0x38,0x5D,0x5B,0x0B,0x38,0x38,0x38,0x5D,0x5B,0x0C,0x38,0x38,0x38,0x38,0x38,0x5D,0x5B,0x0D,0x01,0x20,0xFF,0xFF,0x5D,0x5B,0x0E,0x01,0x20,0xFF,0xFF,0x5D,0x5B,0x0F,0x01,0x20,0xFF,0xFF,0x5D,0x5B,0x10,0x01,0x20,0xFF,0xFF,0x5D,0x5B,0x12,0x01,0x20,0xFF,0xFF,0x5D,0x5B,0x13,0x01,0x20,0xFF,0xFF,0x5D,0x5B,0x2A,0x0F,0x5D};

static void Init_Task(void *pvParameters)
{
	uint8_t i=0, in_val;

	uint16_t buf_out[2]={0xFFFF,1234};
	uint16_t buf_in[1]={0x00};

	spi1_config();
	spi2_config();
	spi3_config();

	Power_Init();


//-------------------------------
//	while(1)
//	{
//        while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
//
//        /* Send SPI2 data */
//        SPI_I2S_SendData(SPI1, 0xAC);
//
//		/* Actual read */
//        while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);
//
//        /* Read SPI2 received data */
//       in_val= SPI_I2S_ReceiveData(SPI1);
//	  	vTaskDelay(20);
//	}
//-------------------------------

//	spi1_read_buf(&buf_in,1);

//	spi1_write_buf(&buf_out,2);
//
//
//	 while(DMA_GetFlagStatus(DMA1_FLAG_TC3)==RESET)
//	 {
//		 taskYIELD();
//	 }
//	 DMA_Cmd(DMA1_Channel3, DISABLE);
//
//
//	 while(SPI1->SR & SPI_SR_BSY)
//	 {
//		 taskYIELD();
//	 }
//
//	vTaskDelay(20);
//
//	spi1_read_buf(&buf_in,1);
//
//	 while(DMA_GetFlagStatus(DMA1_FLAG_TC2)==RESET)
//	 {
//		 taskYIELD();
//	 }
//	 DMA_Cmd(DMA1_Channel2, DISABLE);
//
//
//	 while(SPI1->SR & SPI_SR_BSY)
//	 {
//
//	 }


	 tablo_devices_init();
		Power_On_Channel_1();
		Power_On_Channel_2();
		Power_On_Channel_3();

	tablo_proto_parser(&test_frame_2);

	vTaskDelay(200);
	tablo_proto_parser(&test_frame_2);

	vTaskDelay(50000);

	tablo_proto_parser(&test_frame_1);

	vTaskDelay(50000);

    Proto_Init();

//    keyboard_init();
  //  buzzer_init();
    vTaskDelete( NULL );

}

int main(void)
{
	SystemInit();


	 xTaskCreate(Init_Task,(signed char*)"INIT",128,NULL, tskIDLE_PRIORITY + 1, NULL);

    vTaskStartScheduler();

    while(1);
}
//---------------------------------------------------------------------------------------

void vApplicationTickHook( void )
{
	portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
}
/*-----------------------------------------------------------*/

void vApplicationMallocFailedHook( void )
{
	for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( xTaskHandle pxTask, signed char *pcTaskName )
{
	( void ) pcTaskName;
	( void ) pxTask;
	for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationIdleHook( void )
{
volatile size_t xFreeStackSpace;

	xFreeStackSpace = xPortGetFreeHeapSize();

	if( xFreeStackSpace > 100 )
	{
	}
}
